# Дана строка круглых скобок.
# Если круглая скобка открыта, но не закрыта, то верните False. 
# Если все скобки открыты и закрыты, то верните True.
# Порядок скобок в строке может быть разным!

# Например:
#   "()"              ->  true
#   ")(()))"          ->  false
#   "("               ->  false
#   "(())((()())())"  ->  true
#   ")("              ->  false
#   ""                ->  true
#   "hi(hi)()"        ->  true
#   "hi())("          ->  true

# Ограничения
#   - длина строки <= 100.
#   - строка может состоять из любых символов.
#   - пустая строка возвращает True 


